# kcsv2.py 用串列讀取csv
import csv
print("這是list資料結構")
fn = 'D:\\03爬蟲之旅 30天-水母君\\day1_10python\\Book.csv'
with open(fn) as csvFile:
    csvReader = csv.reader(csvFile)
    print(type(csvReader)) # <class '_csv.reader'>
    data = list(csvReader)
    print(type(data)) # <class 'list'>
print(data)

'''
這是list資料結構
<class '_csv.reader'>
csv結構 : 每個段落是一list資料結構
<class 'list'>   
# 底下資料只有一行,為作筆記列印,自行重排列,下一個例子,以回圈克服
[['0', '1', '2', '3', '4', '5', '6', '7', '8', '9'], 
['10', '11', '12', '13', '14', '15', '16', '17', '18', '19'], 
['20', '21', '22', '23', '24', '25', '26', '27', '28', '29'], 
['30', '31', '32', '33', '34', '35', '36', '37', '38', '39'], 
['40', '41', '42', '43', '44', '45', '46', '47', '48', '49'], 
['50', '51', '52', '53', '54', '55', '56', '57', '58', '59'], 
['60', '61', '62', '63', '64', '65', '66', '67', '68', '69'], 
['70', '71', '72', '73', '74', '75', '76', '77', '78', '79'], 
['80', '81', '82', '83', '84', '85', '86', '87', '88', '89'], 
['90', '91', '92', '93', '94', '95', '96', '97', '98','99']]
'''